package Tanya.task5;

import Tanya.task5.menu.Menu;

public class App {

//    Есть набор предметов, задаваемый заранее, предметы могут повторяться.
//    Предмет имеет 2 параметра (обязательных, остальные добавлять на усмотрение):
//    объем (целое значение) и ценность (целое значение).
//    Предметы неделимы. Также задаётся сейф с обязательным параметром его объёма (целое значение).
//    Нужно написать программу, которая наполняет сейф набором предметов таким образом,
//    чтобы ценность этого набора была максимальной.

    public static void main(String[] args) throws Exception{
        Menu menu = new Menu();
        menu.mainMenu();
    }

}
